tap "daipeihust/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/core"

brew "asdf"
brew "bat"
brew "direnv"
brew "eza"
brew "fd"
brew "fzf"
brew "gh"
brew "ghq"
brew "git-delta"
brew "gpg"
brew "htop"
brew "jq"
brew "killport"
brew "mas"
brew "mycli"
brew "neovim"
brew "pinentry-mac"
brew "pre-commit"
brew "ripgrep"
brew "starship"
brew "tmux"
brew "zsh-syntax-highlighting"

cask "1password"
cask "adobe-acrobat-reader"
cask "alfred"
cask "brave-browser"
cask "clipy"
cask "discord"
cask "docker"
cask "dropbox"
cask "figma"
cask "google-chrome"
cask "google-drive"
cask "google-japanese-ime"
cask "honto"
cask "iterm2"
cask "jetbrains-toolbox"
cask "jordanbaird-ice"
cask "karabiner-elements"
cask "kindle"
cask "rectangle"
cask "sequel-ace"
cask "slack"
cask "visual-studio-code"
cask "zoom"

mas "Focus To-Do", id: 1258530160
mas "GoodNotes", id: 1444383602
mas "LINE", id: 539883307
mas "MenubarX", id: 1575588022
mas "Spark", id: 1176895641
